###########
#   do1   #
###########
mtest> mtreset 190

mtest> mtnew 3

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 192 Bytes
* Number of blocks      : 1
* Free mem in last block: 72
* Recycle list          : 

=========================================
=             class MemTest             =
=========================================
Object list ---
ooo
Array list ---


mtest> mtdel -r 3

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 192 Bytes
* Number of blocks      : 1
* Free mem in last block: 72
* Recycle list          : 
[  0] = 2         
=========================================
=             class MemTest             =
=========================================
Object list ---
xxo
Array list ---


mtest> mtnew 5 -a 3

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 192 Bytes
* Number of blocks      : 6
* Free mem in last block: 72
* Recycle list          : 
[  0] = 2         [  1] = 5         
=========================================
=             class MemTest             =
=========================================
Object list ---
xxo
Array list ---
ooooo

mtest> mtdel -r 2 -a

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 192 Bytes
* Number of blocks      : 6
* Free mem in last block: 72
* Recycle list          : 
[  0] = 2         [  1] = 5         [  3] = 2         
=========================================
=             class MemTest             =
=========================================
Object list ---
xxo
Array list ---
xxooo

mtest> mtnew -a 2 3

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 192 Bytes
* Number of blocks      : 8
* Free mem in last block: 112
* Recycle list          : 
[  0] = 2         [  1] = 6         [  3] = 2         
=========================================
=             class MemTest             =
=========================================
Object list ---
xxo
Array list ---
xxoooooo

mtest> mtnew -a 5 3

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 192 Bytes
* Number of blocks      : 11
* Free mem in last block: 0
* Recycle list          : 
[  0] = 2         [  1] = 6         [  2] = 1         [  3] = 2         

=========================================
=             class MemTest             =
=========================================
Object list ---
xxo
Array list ---
xxooooooooo

mtest> mtnew -a 7 2
Requested memory (264) is greater than block size(192). Exception raised...

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 192 Bytes
* Number of blocks      : 11
* Free mem in last block: 0
* Recycle list          : 
[  0] = 2         [  1] = 6         [  2] = 1         [  3] = 2         

=========================================
=             class MemTest             =
=========================================
Object list ---
xxo
Array list ---
xxooooooooo

mtest> mtdel -r 8 -a

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 192 Bytes
* Number of blocks      : 11
* Free mem in last block: 0
* Recycle list          : 
[  0] = 2         [  1] = 6         [  2] = 4         [  3] = 3         
[  5] = 2         
=========================================
=             class MemTest             =
=========================================
Object list ---
xxo
Array list ---
xxoxoxxxoxx

mtest> mtdel -r 9 -a

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 192 Bytes
* Number of blocks      : 11
* Free mem in last block: 0
* Recycle list          : 
[  0] = 2         [  1] = 6         [  2] = 4         [  3] = 4         
[  5] = 3         
=========================================
=             class MemTest             =
=========================================
Object list ---
xxo
Array list ---
xxxxoxxxxxx

mtest> mtdel -i 8 -a

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 192 Bytes
* Number of blocks      : 11
* Free mem in last block: 0
* Recycle list          : 
[  0] = 2         [  1] = 6         [  2] = 4         [  3] = 4         
[  5] = 3         
=========================================
=             class MemTest             =
=========================================
Object list ---
xxo
Array list ---
xxxxoxxxxxx

mtest> mtdel -i 12 -a
Size of array list (11) is <= 12!!
Error: Illegal option!! (12)

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 192 Bytes
* Number of blocks      : 11
* Free mem in last block: 0
* Recycle list          : 
[  0] = 2         [  1] = 6         [  2] = 4         [  3] = 4         
[  5] = 3         
=========================================
=             class MemTest             =
=========================================
Object list ---
xxo
Array list ---
xxxxoxxxxxx

mtest> q -f



###########
#   do2   #
###########
mtest> mtn 10

mtest> mtn 5 -a 256

mtest> mtn 5 -a 512

mtest> mtd -i 7 -a

mtest> mtd -i 0 -a

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 65536 Bytes
* Number of blocks      : 3
* Free mem in last block: 47096
* Recycle list          : 
[256] = 1         [512] = 1         [ 15] = 1         [283] = 1         

=========================================
=             class MemTest             =
=========================================
Object list ---
oooooooooo
Array list ---
xooooooxoo

mtest> q -f



###########
#   do3   #
###########
mtest> mtr 120

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 120 Bytes
* Number of blocks      : 1
* Free mem in last block: 120
* Recycle list          : 

=========================================
=             class MemTest             =
=========================================
Object list ---

Array list ---


mtest> mtn -a 2 1

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 120 Bytes
* Number of blocks      : 1
* Free mem in last block: 40
* Recycle list          : 

=========================================
=             class MemTest             =
=========================================
Object list ---

Array list ---
o

mtest> mtn 1

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 120 Bytes
* Number of blocks      : 1
* Free mem in last block: 0
* Recycle list          : 

=========================================
=             class MemTest             =
=========================================
Object list ---
o
Array list ---
o

mtest> mtn -a 2 1

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 120 Bytes
* Number of blocks      : 2
* Free mem in last block: 40
* Recycle list          : 

=========================================
=             class MemTest             =
=========================================
Object list ---
o
Array list ---
oo

mtest> mtn -a 1 1

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 120 Bytes
* Number of blocks      : 3
* Free mem in last block: 72
* Recycle list          : 
[  0] = 1         
=========================================
=             class MemTest             =
=========================================
Object list ---
o
Array list ---
ooo

mtest> 
mtest> mtr 80

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 80 Bytes
* Number of blocks      : 1
* Free mem in last block: 80
* Recycle list          : 

=========================================
=             class MemTest             =
=========================================
Object list ---

Array list ---


mtest> mtn -a 2 1

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 80 Bytes
* Number of blocks      : 1
* Free mem in last block: 0
* Recycle list          : 

=========================================
=             class MemTest             =
=========================================
Object list ---

Array list ---
o

mtest> mtn 1

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 80 Bytes
* Number of blocks      : 2
* Free mem in last block: 40
* Recycle list          : 

=========================================
=             class MemTest             =
=========================================
Object list ---
o
Array list ---
o

mtest> mtn -a 2 1

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 80 Bytes
* Number of blocks      : 3
* Free mem in last block: 0
* Recycle list          : 
[  0] = 1         
=========================================
=             class MemTest             =
=========================================
Object list ---
o
Array list ---
oo

mtest> mtn -a 1 1

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 80 Bytes
* Number of blocks      : 4
* Free mem in last block: 32
* Recycle list          : 
[  0] = 1         
=========================================
=             class MemTest             =
=========================================
Object list ---
o
Array list ---
ooo

mtest> 
mtest> q -f



###########
#   do4   #
###########
mtest> mtr 0
Illegal block size (0)!!
Error: Illegal option!! (0)

mtest> mtr 39
Illegal block size (39)!!
Error: Illegal option!! (39)

mtest> mtr 40

mtest> mtn 1

mtest> mtn 1 -a 1
Requested memory (48) is greater than block size(40). Exception raised...

mtest> mtn 1 -a 0
Error: Illegal option!! (0)

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 40 Bytes
* Number of blocks      : 1
* Free mem in last block: 0
* Recycle list          : 

=========================================
=             class MemTest             =
=========================================
Object list ---
o
Array list ---


mtest> MTD
Error: Missing option!!

mtest> mtd -a
Error: Missing option!!

mtest> mtd -r 4

mtest> help mtn
Usage: MTNew <(size_t numObjects)> [-Array (size_t arraySize)]

mtest> mtn 5

mtest> mtr 500

mtest> mtn 5

mtest> mtd -a -Ran 3
Size of array list is 0!!
Error: Illegal option!! (-Ran)

mtest> mtd -r -3
Error: Illegal option!! (-3)

mtest> mtd -r 3

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 504 Bytes
* Number of blocks      : 1
* Free mem in last block: 304
* Recycle list          : 
[  0] = 2         
=========================================
=             class MemTest             =
=========================================
Object list ---
oxoox
Array list ---


mtest> mtn 123

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 504 Bytes
* Number of blocks      : 11
* Free mem in last block: 264
* Recycle list          : 

=========================================
=             class MemTest             =
=========================================
Object list ---
oxooxooooooooooooooooooooooooooooooooooooooooooooo
oooooooooooooooooooooooooooooooooooooooooooooooooo
oooooooooooooooooooooooooooo
Array list ---


mtest> mtd -r -r 23
Error: Illegal option!! (-r)

mtest> mtd -r 23 -r
Error: Extra option!! (-r)

mtest> mtd -r 23

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 504 Bytes
* Number of blocks      : 11
* Free mem in last block: 264
* Recycle list          : 
[  0] = 20        
=========================================
=             class MemTest             =
=========================================
Object list ---
oxooxoooxxooooooooooxoooxooooooooooooxoooooxxoxooo
oooooooooxoxooooooooooooooooxoooxoooooooooooooooox
ooooooxxoxooxoxoooooooooxxoo
Array list ---


mtest> mtd -r 23 -i 5 -a
Error: Extra option!! (-i)

mtest> mtn 123 -a 999
Requested memory (35976) is greater than block size(504). Exception raised...

mtest> mtn 123 -a 0
Error: Illegal option!! (0)

mtest> mtn 123 -a 10

mtest> mtd -ARR -i 54

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 504 Bytes
* Number of blocks      : 134
* Free mem in last block: 136
* Recycle list          : 
[  0] = 20        [  3] = 122       [  7] = 1         [ 10] = 1         

=========================================
=             class MemTest             =
=========================================
Object list ---
oxooxoooxxooooooooooxoooxooooooooooooxoooooxxoxooo
oooooooooxoxooooooooooooooooxoooxoooooooooooooooox
ooooooxxoxooxoxoooooooooxxoo
Array list ---
oooooooooooooooooooooooooooooooooooooooooooooooooo
ooooxooooooooooooooooooooooooooooooooooooooooooooo
ooooooooooooooooooooooo

mtest> mtd -a -r 100

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 504 Bytes
* Number of blocks      : 134
* Free mem in last block: 136
* Recycle list          : 
[  0] = 20        [  3] = 122       [  7] = 1         [ 10] = 75        

=========================================
=             class MemTest             =
=========================================
Object list ---
oxooxoooxxooooooooooxoooxooooooooooooxoooooxxoxooo
oooooooooxoxooooooooooooooooxoooxoooooooooooooooox
ooooooxxoxooxoxoooooooooxxoo
Array list ---
oxoxxxooxoxxooooxooxxoxoooxoxoooxxxooxxoxxxxxxxoxo
xooxxoxoxxoooxxxxoxxxooxxxxxxxxxxxoxxxxxxooxoxxoxx
xoxxxxxxoxoxoooxoxxoxox

mtest> mtn 60 -a 11

mtest> mtn 60 -a 10

mtest> mtr

mtest> mtn 123 -a 10

mtest> mtd -ARR -i 54

mtest> mtd -a -r 100

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 504 Bytes
* Number of blocks      : 123
* Free mem in last block: 136
* Recycle list          : 
[  3] = 122       [ 10] = 66        
=========================================
=             class MemTest             =
=========================================
Object list ---

Array list ---
oxxoxxxoxooxoxxoxxxxxxxxxoxxoxoooooxxxoooooooxxxxo
xoxoxxoxxoxxxoxxxxxoxoxxxxxoxxoxoooooxooxooxooxooo
xooxoooxxoxxooxooxoxxox

mtest> mtn 60 -a 10

mtest> mtn 60 -a 10 -i 3
Error: Extra option!! (-i)

mtest> mtn -a 10 60

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 504 Bytes
* Number of blocks      : 177
* Free mem in last block: 136
* Recycle list          : 
[  3] = 176       
=========================================
=             class MemTest             =
=========================================
Object list ---

Array list ---
oxxoxxxoxooxoxxoxxxxxxxxxoxxoxoooooxxxoooooooxxxxo
xoxoxxoxxoxxxoxxxxxoxoxxxxxoxxoxoooooxooxooxooxooo
xooxoooxxoxxooxooxoxxoxooooooooooooooooooooooooooo
oooooooooooooooooooooooooooooooooooooooooooooooooo
ooooooooooooooooooooooooooooooooooooooooooo

mtest> mtr 1234

mtest> mtr -123
Illegal block size (-123)!!
Error: Illegal option!! (-123)

mtest> mtr 100000

mtest> mtn 60 -a 10

mtest> mtn 30 -a 5130
Requested memory (184688) is greater than block size(100000). Exception raised...

mtest> mtn 80 -a 2058

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 100000 Bytes
* Number of blocks      : 80
* Free mem in last block: 25904
* Recycle list          : 
[106] = 1         [719] = 78        
=========================================
=             class MemTest             =
=========================================
Object list ---

Array list ---
oooooooooooooooooooooooooooooooooooooooooooooooooo
oooooooooooooooooooooooooooooooooooooooooooooooooo
oooooooooooooooooooooooooooooooooooooooo

mtest> mtn -r 20 -a
Error: Illegal option!! (-r)

mtest> mtn -r 50 -a
Error: Illegal option!! (-r)

mtest> mtn 60 -a 10

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 100000 Bytes
* Number of blocks      : 80
* Free mem in last block: 3824
* Recycle list          : 
[106] = 1         [719] = 78        
=========================================
=             class MemTest             =
=========================================
Object list ---

Array list ---
oooooooooooooooooooooooooooooooooooooooooooooooooo
oooooooooooooooooooooooooooooooooooooooooooooooooo
oooooooooooooooooooooooooooooooooooooooooooooooooo
oooooooooooooooooooooooooooooooooooooooooooooooooo


mtest> mtn 30 -a 4878
Requested memory (175616) is greater than block size(100000). Exception raised...

mtest> mtn 80 -a 2058

mtest> mtn 1 -a 266

mtest> mtn 60 -a 11

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 100000 Bytes
* Number of blocks      : 161
* Free mem in last block: 91840
* Recycle list          : 
[106] = 2         [719] = 157       
=========================================
=             class MemTest             =
=========================================
Object list ---

Array list ---
oooooooooooooooooooooooooooooooooooooooooooooooooo
oooooooooooooooooooooooooooooooooooooooooooooooooo
oooooooooooooooooooooooooooooooooooooooooooooooooo
oooooooooooooooooooooooooooooooooooooooooooooooooo
oooooooooooooooooooooooooooooooooooooooooooooooooo
oooooooooooooooooooooooooooooooooooooooooooooooooo
ooooooooooooooooooooooooooooooooooooooooo

mtest> mtn 30 -a 4879
Requested memory (175656) is greater than block size(100000). Exception raised...

mtest> mtn 80 -a 2059

mtest> mtn 10 -a 10

mtest> mtn 32 -a 266

mtest> mtn 54 -a 522

mtest> mtn 76 -a 778

mtest> mtn 98 -a 1034

mtest> mtn 200 -a 3476
Requested memory (125144) is greater than block size(100000). Exception raised...

mtest> mtd -r 3000 -a

mtest> mtn 218 -a 2324

mtest> mtn 170 -a 404

mtest> mtn 64 -a 532

mtest> mtn 192 -a 660

mtest> mtn 2 -a 1172

mtest> mtn 130 -a 1300

mtest> mtn 24 -a 1428

mtest> mtd -r 300 -a

mtest> mtn 86 -a 788

mtest> mtn 214 -a 916

mtest> mtn 108 -a 1044

mtest> mtn -r 1000
Error: Illegal option!! (-r)

mtest> mtn -r 1000 -a
Error: Illegal option!! (-r)

mtest> mtn 623 -a 256

mtest> mtn 623 -a 1024

mtest> mtn 24 -a 1428

mtest> mtn 30 -a 3 

mtest> mtn 30 -a 3

mtest> mtn 123

mtest> mtd 55 -r
Error: Illegal option!! (55)

mtest> mtn 20000

mtest> mtd -i 0

mtest> mtd -i 20000

mtest> mtd -i 0

mtest> mtd -a -r 1234

mtest> mtd -r 12345

mtest> mtn 1234

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 100000 Bytes
* Number of blocks      : 1279
* Free mem in last block: 36440
* Recycle list          : 
[  0] = 7995      [256] = 203       [1024] = 200       [  3] = 20        
[ 10] = 130       [2058] = 159       [266] = 33        [522] = 53        
[778] = 76        [1034] = 98        [ 11] = 59        [2059] = 80        
[2324] = 88        [532] = 25        [1300] = 57        [788] = 30        
[1044] = 37        [ 28] = 70        [ 49] = 1         [561] = 1         
[1349] = 39        [325] = 1         [ 83] = 1         [352] = 28        
[106] = 2         [115] = 3         [116] = 12        [136] = 48        
[404] = 80        [660] = 93        [1172] = 1         [1428] = 12        
[916] = 66        [156] = 1         [412] = 28        [166] = 10        
[176] = 1         [688] = 1         [177] = 65        [433] = 1         
[945] = 1         [689] = 53        [442] = 25        [965] = 1         
[709] = 48        [453] = 217       [718] = 78        [719] = 157       
[1743] = 1         [215] = 62        [472] = 1         [729] = 310       
[491] = 1         [244] = 1         
=========================================
=             class MemTest             =
=========================================
Object list ---
xooxoooooxoxxoxooooxxooxoxxoooxoxoxoooxxxxoxoxooxx
oxoxoxoxxxoxooxoxoxoxxoxoooxxoxxoxxxoooxooxxooooxo
ooxxoxoxxoxxooxxxoxoxoxoooxxxooxoxoooxxxoxooooxxox
oooooxxxxxoxxoxxoxoxoxxxooxooxooxooooxooxoxoooxoxo
oxxxoxooooxoxoxxoooooxxoxxoxxxxoxoooxoxoooxoooxoxo
xooxoxoxooooooxxoxooxoooxxxoooxooooxoxoxxxooooxxxo
xoxooxxoxoxooxxxooxxxxxooxxxxoxoooxooooooxxxoxxoxo
xooooxoxxoxxxxooxxoxxxooxxoooxxxooooxoxoooxxooxoxx
ooooxxoooxooooxxxoooxooooxxxxooxoxxxxxxxoxoxoxoooo
oxxxooxxooooooxxxooxxoxoxxoxooxxooooooxxooooooooxo
oooxxxooxoxxoooooxoxoooxoooxoxxxxooooxoxxoxooooxxx
oooxoxooxoxoxoooxooxoxoxoxoxxxxooxooxxxxxoxxoooxxx
ooxooxxoooxxoxxxooxoxxxxooooxxxoooooxoxxoxoxooooox
xxxooxooooxoxoxxoooxxoxoooxooxoooooooxxoxxoooxxoox
xoxoooooxooxooxooooooxoooooooxxoxxxooxoooxxoxxxxoo
ooooxxoxxooxooxooxxxoxxoxoxooooooxxoxoxoxoooxxxoxx
ooxxooxxoooxoxxoxoxoxoooooxxoxooxxxoxooxxoxooooooo
xoxoxxoxxxxxoxoxxoxoooxxxooooxoxxooxoooooooxoxooxo
oooxxooxooooxxooxoooxooooxooxooxoooooxooxxoxxoxooo
oxxooxoxoxoxoooxxoxoxooxooxoooxxooooooxxoxxoxxxxxx
ooxoooxooxooxooxoxooooxxooxxoxoxooxxoxooooxooooooo
oooxoxooxxxoxoxxooxxxxoxxoxoxxxxoooxoooooooxoxoxxx
oooxoxxooxxxoooxooooooxxxooooxxxooooooooxxxoooxxox
xoxoxoxxxoxooxoxxxxooxxooooxooxoooxxxxxxxoxxxoxoxx
xoxoxxxoxoxooooxooxooooxxoxooxxxooxoxxxxooxoooxxxo
oxxxooxoxooxxoxxoxxooxoxoxxxxxoxoxxxoxxooooooxooxx
xooxxxooxooooooxooxoxooxxooxxooxooooooxooxxxxxxoox
xxooxoxxxxxoooxxoooxooxxxoxoxoxxooxoxxoxoxoxxoooox
oxoooxxxoxoxxxooxoxooxooxoxoxoooxxoxxxooxxxooxxxxx
oxooooxoxxxoxoxoooxxoooxoxoooxxooxxooxxxoooxoxoooo
xooxxxxxoxxxxxoooxooooooxxooxooooxoooooooxxxoooxox
xxooxxoxooxoxoxxxxooxxooooxxoxoooxooxxoooooxoooxox
oxxxooxoxxooxxooxxxoxooxxooxxxxxoooxooxoooooxxooxx
ooxooxxoooxooooooooxxoxoxoxxxxoooxoxxoxooxxoxxxoxo
oxxooooxoooooxooooxxooxoxoxoxoxooxxoxooooooxoxxoox
xxxooxooooxooxxxoxoxxoxoooooooooxoooooxoxooxoooxoo
xxxoooxooxxooxoxoxxooxxxooxxoooooooxxxxoooooxoxoxx
ooooooxoooxoxxxxoxooooxoooxxoxoxxoooooxoxxxooxooox
xooxxxxxoxoxooxooxxooxxooxxooxxxxxxoxxoxxxoxxxxxxo
xooooxxoooooxoxoxoooxoxoooooxoxooxooxxoooxxoxooooo
xooxxoxxoooooxxoxxxoooxoooxooooxxooxxoxooxxxoxxooo
oxxoxoxoooooooxoxxxxoxoxxoooooxxxoxooooxooxxxooxxo
oxooooxoxooxoooxoooxxoooooxxxxoxooxxxxxooxoxoxxoxx
oxooooxxoooxoxoooooxoooxoooxxxxoxxooxxoooxoooxooxx
xooxooxooxoooooxxoxooxxxoxxxooooxoxooxooxooxxoooox
oxxoxoooxxxoxxoxxoxxxxxoxoxxoooooxoxooxxoxxoxoxxox
oxxxxoxxxxoooxoxxxxooxxoxoxxoxoxxxoxxooxxooxoxxoxo
xxooxxoooxoxxxooxxoxoxxxoxxxoxooxooooxooooooxxoooo
oxooooooxoxoooxxxxooxoxoxxoxxxxoooxxxxoxoooooxxoox
xxxxoooooxoxxooooxxooooxxxoooxxxoxxoxxxxxoxoxooxxx
xoxoxoxoooxooxooooxxxxooxxxoxxooxoxoxooxxoxxooxooo
oxoxoxoxoooxoooxxoxxooxoooxoooxxoxoxxooxxooxoxooox
xoxxoxoooxoxxoxooooxoooooxxooooxoxxoxxxxooxxxooxox
xooxxooooxoxxoxoxxxoxxxxxoxoxoxoxoooxxoxxxoxxoxxxo
xxxoxoooxoxooxoxoooooxoooxoooxooooxxxoxoxooooxxoox
xxxoxxxooxooxooxoooooxoooxxxxxooxxxxoxxxoooooxxxxx
xxxxxoxoxxxoooooxxoooooxoxoxooxoxoooxxooxxxoxxxoox
xooxooxoooooooxoxxoooxoxxxooooxxxxxxoxxxxxoxooxxxo
xxoooooxoxxxoxxooxoxoxoooxxoooxoooooxoxooooooooooo
xoooooooxxoxoxxoooxooxxoxxoxxxxoxxooxxoxooooooooxo
ooooxxxxoxooxxxxoxoxooxooxxoooooxxxooxoxooxxooooox
ooxoxxxoxxooxxxoxooxooxooxoooooxxxxxoxooxxooxooxxo
oxoxoooxxxoxooxxoooooxxoxxooxoxoxxxxoxoooooxxxoxoo
xxooxxxoxxooxxxxoxxxxooooxxooooxoxoxxoxxxxxooxooxo
xxxooooxxxxxxxoxxoxoxxxoxooxooooooxxxoxxxxoxooxoxx
ooxxoxoooooxxxoxxooxooooooxxoxxxxxxxoxxxxxxxxxxooo
xxooxxooxxoxooxxoxxoxooooxxxoxxxxxooxxooxxxxxooxxo
oxxxxxoxxoxooxxxxxooooxxoxoxooxoooooxxxoxxooooxoxx
ooxoxooooooxoxooxoxoxoxxxoxxoxoxoooooooxxooxooxoxx
oxxoxoooxoxoxooxoooxooxxoooxooxxxxooxxxoxxxxxxoxoo
xxxxxoxxoxoxxxxooxxooxooxoooxooxooxxooxxoooxoxooxo
xxxxoxxxooxoooooxxoxoxxooxxxoooxxooxxxxxxoxxxooxox
oooxoooxxxxxxxxoxoxxxoxxxxoxxxoooooooooxxoxxoxxxoo
ooxxoxoooxooxooxxxooxxxooxxxoxxoxooxoxoxxooxxooxoo
xxxxxoooxooxxoxxoxooxxxxoxxxxxxooxxooxxoooxxoxxooo
ooooxoxoxooxoxoxxxoooxooxooxoxoooxooxxoooooooxxoxx
ooxxooxoooooxxxoxxxoxxooxxxxooooxooxooooxoxxooxoxx
xxooxxooxoxxoooooooooooxoxxoooooooooxxoxxoooxxxoox
oxoooxxoxxoooxxoxoxxxxooxoxxxoooxxooooxoxxxoxoxoxo
xxxoxooxoxoooooooxxoooxoxooxoxxxooxoxxoxoooxxooxxx
ooxooxoooooxxoooxxoxoooxxooooxoooooxxxxxxooooxoxoo
ooooxxxxoxoooxoxxxoxoxoxoxoooxoxxooxoxoooxxxxoxxxx
oxoooooxxxoooooxoxxxooxxooooooooxoxooooxoxxxoooxoo
xxoxxxxoxxoxoxxoxoooooxooxooooxoxoooxxxxoxxxxxxxxx
xxoooxoooxxxoxoxoooooxooxoxxoxxoxxxxxoxoxoooxoxxox
oxoxxoxxxoxoooooooxxooooxxoxoxxxxoxxxooxooxxoooxxo
oxoxxoxxxoxxooxoxxooxoooooooooooooxoooxxoxxooooxox
xxxooooxoxxxoxxoooooxoxooooooxoooooxxxoxxxxxooxoox
xooxoxooxoooooooooxxxoxxooooooooooxooxoxxxxoooxoox
xxoooxxooxooxoxxooooxxxoxoxoxxoxxxxxxoxoxxxooxxxxx
ooxooxooooxxoooxxxxxoxxxoxooxoooooxxxxoooxooooooxo
xoxooxxxoxooxoxoxxoooxxoxxoooxooxxoxxooxxxooooxooo
ooooooxxoxxxooxxxxxoooooooxxooxooxxxoxxoxxxoxoxxox
oooooxooooooxoxxoooxoxoxoxoxxxoxooxooxooooooxxoxoo
ooooxoooxoooxoooxxoooooooxoxooooxooooooxooxoxooooo
xoxxoxoxxxooooxxoxooxooxoxoooxxoxxoxooxooooxoxoxox
oxxooooooxoooxooxxxxooxoxoooooxxoooxxxooxooxxoooxx
xxxxxoooxooxoxoxoxoooxoxxxxooooxxoxoxxxxoxooooooox
xxxxooooooxoxxoxoooxoxxoxoxoxoxooxxxxxooxooxxxxxxx
oxoxxxooxooxooooxxooxooooooxxooxxxoxxoooooxoooxoxx
xoxxxooxoooooxooxoooxoxoxxxxxxoxxoxooxoxooooxooxxo
oxxxxxoxoxoooxxxxooxoxxxoxoooxxoxooxxoooxxoxxxxxxx
xxxooooooooxoxooxoxoooxoooxxooooooooxxxxooxxxoxxoo
oxooxxoxxooxxoooxxxooxxxooxoooxooooxxoxoooxxoxxoxx
oxxooxoxoxooooxxxxxoooxxxxxoooxoooxxooxoxoxxooxxxo
xoxxoooxoxooxoxxxxxooxxxoxxoxxxoxxoxoxxooxxooxxoxx
oxxoxxooooxoxoxoxoxxxooooooxoxxooooxooxxoooxoxxoxx
oooxxxoooxoooxxooxoxooooooooooxoooooooxxxxxoxoooox
oxooxooxxxooxooxoxxoxoxxxxooxoooxoxoxxooxoxooxooxx
oooxxxxoxxxoooxxoooxxooxooxoxooxoxoooxoooxoooooxxx
oooxoooxooxooxooxoxxoxxooooxooxoxxxxxxoxxoooxxxxxo
xoxoxoxoxxxooxooooooooxoxxoooxooooooxooxxxoxxxxxox
ooooxooxoooxxxoxxxxxooooxoxxxoxooxxxxooxoxxxoxxxxx
oxoooxxoooooxxxxoxoooxoooooooooooxooooxooxxoxoxxxx
xoxxoxooooxoxoooxxoxoxxooxoooxxxoxoooxoooooooooxxo
xooooooxoxxooxxxoxoxoooxxoxoooxooxooxooooxxxxooxoo
oxoxooxxxoxxxxxoxooooxooooxoxooooxxxoxooxoxoxxoxxx
ooxxooxoxxoxxxooooxxooxoxoxxxxooxxoxooxxoxoooxxxoo
xoxxxoxxooxooooooxooooxooxxoxooooxoooxoxoxxxoooxox
xxxxxxoooxxooxooxoxxooxoooxxooxxxooxxooxxxoxxxoooo
xxxxxooooxxxooxxoxxoxooxoxooooxoxoxxoxooooooooxoxo
oooxoxooxoxoooxoxxxxoxooooooxooxoxxxxxoxxxoxxoxoox
xooxxooxxooxxoxxooooxxoxxooxxxooooxxoooxoooxxxoxxx
ooxxooxooxxoxxoooooxooxxxoxoxxoooxxxooxoxooxxxxxxo
xxooooxxxxoxoxoooxooxxoxooooxoxoxoooxooxoooooxxoxx
xooxooxooxoxxoxxooxxxooxoxxxooxxooxxxxooxxxoxooxxo
xooooxxoooxxxoxoooxooxoooxxxxxxoxoooxoooxooooxxoxo
xxoxxxxoxooxxxooooxxxoxoxoxoooooooooxoooxxxoxxooxx
oxxxoxxoxooxxxoxoxxooooxxoxoxooxooxxxxxxoxxoxxxxoo
ooxoxxxxoxoxxxoooxxooxoooxooooxxxooxxxxxxoooxooooo
ooooxooxooxoxxooxoxxxxoxoxxoxxxxoooooxxxooxooxxoox
ooxxxoxxoooxxoxxoxoxooxoooxxooooooooxxxxooooooooxo
oxxooooxxxxxxooxxooxxxoxxxoxoxoxoooxooooxoxooxoxxx
oxxxoxxxooooxxxxxoxooxoxxxoxxooxooxxxxooxxxxoxxoxx
oxoxxooxxxoxooxoxooxxxooxooxoooxoxxoooxxoxooxxxoxo
ooxoxooxxxoooxooxxxxooxoooooxooxxoxooxoooxoooxoxoo
xxooxxoxxooxoooooxoxoxxoxxxoxoooxooooxxxoxoxxxoooo
oooxxoooxxoooxxxoxxxxxoxooxxoooooxoxxooooooooxoxox
oxoxxoxooxoooxooooxoooxxoxxooxxxxxoooxoxxxooxxxooo
oooxxxoooxxoxxooooxxoooxxxooxoxooxoooxxxxooooxxxoo
xoooxoxoxoxooxooxoooxooxoxoxxoxxxoooxooxxxooxxxoxx
xxoxxxoooxxooxooxoxoooxxxoooxxoxooooxooxoxooxooooo
xoxoxxoxxxoxxxoxxxoxooxoxoxoxxoooooxooxxxxxooooooo
xxoxoxxxooooxxoxxooooxxxxxoxoxxoxoxoxoxxoxoxxooxoo
oooooxooxxxxooxoxxooooxoxxoxxoooxoxxooooxoxxxooxoo
xxoxxxxxoxxxxoxoxoxooxoooxooooooxoooooooooooooooxx
xxxxoxxoxxooxxxoxoooooxoxooooooxxxooooxxooxoxxoxox
oxoxxxxoxoxxooooxxxoxoxoooxoxxxoxxxooooxoxoooxoxoo
xoooxxoxxooxoxoxooxooooxooxoxxxxoxxxoxoxoxoooooooo
xoooxooxxxxooxooxxoooxxoxoxoxxoxooxoooxxoxxxooxxxo
ooooooxxoooxoooxxoxooxxooxxxoooxoooooxxxxooooxoxxo
ooxoxxxxooooooxxoxooxxoxooooxxooxxxxxooxxoxxoxoxoo
ooxoxoooxxoxxooxoooxxooooxxxxoxxoooooxxxxoxxxoxxoo
oxoooooxxooxoxxxooxoxooxoxxxoxxoxxooxxxoooooxooxoo
xxxoxxooxooxxoxxoxoxxoxoxxoxxoxxxxoooooxooxooooxoo
xxooxoxoxxoxoooxxxxxxxxoxxoxooxxxoooooxooooxooooxo
ooxooooxxxoooooxxoxoxxoxoxoxooxoooxooxxxxoxxoooxxo
oxxoooxxxxooooxoxoxooxooooooxoxooxooxoooxxxxooxooo
xoxoxxooxoxxooxxooxxooxxooooooooooxoxxooxxxoxooxxo
oxxxoxoxxoooxoxxoxxooooxooxoxoooooooxxxxxoooxxooxo
oxoxoxoxooxoxooxooxxoooxooxoxxoooooxooxxooooooxxxo
oooxoxoxooooxoxxooxxxooooooxxoxoooxoxxooxxooooxxxo
xoxooxxxxoooxoxxxoooooxoxxxooxooooxxxxxoxoxoooxoox
xoxxoxoxoxxxoxxxoooxxoxoxxooxxooxoxooxxoxxoxooooxo
oxxxoxoxxoooooxooooooxxoooooxxooxxoooxoxxoxooxooox
xooooxoxoooxoxoxooxooxoxxoxooxxxoxooxxooooooxxxoox
xxxxxxxooooxooxoxxxxoooooooxxxxoxxxoxoooooooooxxxo
oxoxxxoxoxoxxxoooxooxoooxoooxxoooooxooxxoxxxxooxxo
ooxxxoxxxxoxxoxxoxooxooxxoooooxoxoooxoxxxoxxxxoxxx
xoxxooxoxoxxxooxoooxxxoxxxxxoxooooxxxxoxoxoxxxxooo
oxxxxoxoxxoxxxoooxxoooxoooooooooxxxoxooooxxoxooooo
xxoxxxoooxxoxxoooxoxxooxoxoxooxxoxxxoooooooxxxxxxx
oxxoxoxoxoooxooooxxxxxooxooxxoooooxooooxxxoxoooxxo
ooxoxxoooooooxoxxooxxxoxooooxxoooxxoxxoxxooxoxxoox
xxoxxxxooxxxoxooooxoooooxooxooxxxoxoooxxxoooxxxooo
xooxoooooooxxoxxxxooxxooxoxoxxoooxooxoxooxxxxooxoo
oxooxxxooooxoxoxxoxxooxoxxxxxoxoooooxoxxxoxxoxoxox
ooxxooxooxxooxxxoxxooxxooxxxoxooxxxooooxoxooxxooxx
ooxoxxooxxxoooooxooooxxoooxooxxxxoxoxxxoxoxxxoxooo
oxxxxoxxxxooooxooxxoxooooxxooxooxoxxooooxoooxooxoo
xoxoxxooxxooooooooooxxxxoxxxoooxxxoooxoxxooooxoxoo
oxoooxxoxxxooxxoxoooooxooxxooooxxoxoxooxooxoxxooox
oxxooooxoxoxoooxoxoxxxoxoxoxoooxoxoooooxxoxoxxooox
oooooxooooooooxxxooooxooxxoooxxxxxxoooxoooxoooxxxo
xooooooxooooooooxoooxxxxxooxoxxooxooooxxxooxxxxooo
xooxoxxooooxxoxxooxoxoxxxxxxxxxxxoxxxoxooxoooxooxx
xxxoxxxoxxxxoooxxxoxooxxxxxooooooxoxxoxxoxxxoxooox
xxxxooxooooxooooooooxxxooxxxoxxxxoooxoxoooxxxoooxo
ooooxoxxxxxxoxooooxoxoxoooxxoooxoxoxxooooxoxooxxoo
oooooooxxooxoooxxxooxxoooxxoooxxxoxooooxooxoxxxxxx
oxooxoxooxxxxxxooooxxooxoxxoooooxxooooxoooxoxoxooo
xoooxoxoxooxoxoxxoooxooxooooooxoxoxoxoxooxxxooxxoo
oooooxoooxoxxoooxxoooxooooooooxoxooxxxoxxxoooooxxx
xoxooxoooxxxoooxoxooooxxoxxxoxxooxooooxxoooooooxxo
xoxoxxxxxoxxoooooxxxxoxxoooooxooxxooxoxooxxxxxxooo
oooxoooxxxooxxoxxxoooxoxxxoxoxxooxooxxoooxxoooxoxx
xoxxxoxooooxoxoxxoooxoooxoxxoxxoxxxxooxxxooxooxoox
xoxoxxoxxxxxxooxxxoxxxooooxoooxxoxxoxooxxxoxoxxxox
oxoxooxooooooxoooooxxoxxxooxoxxoxooxxoooxxoooxxxox
oooxoxoxooxoxoxxooxoooooxxoxoxooxooooxoxxoooxoxoxx
ooooxxooxxxoooxoxooooxxooxoxoxooxoxoxoxxoooxxoxxxx
xxoxooooxxoxxxxooooooooxooxxxxxxxooooooooooxxxxoox
xooxxxxxxxoooxoxooxoooooooxooooxoxoxxxxxoxoxxoxoxo
ooxxxoxxxxxxxxxxoxxoooooooxoxoxooxxooxoxoxooooxooo
xoooxoxoooooooooooxxxoxoxxxoxxooooxoxxooxxxoxxoxoo
xxxooxxxxoxxoxooxxxxooxooooooxxoxoxxooxoxooxoxoxox
xxoooxooxxooxoxxoooooxoooxxooxooxoxxxxxoxoxoxooxxx
oxoxooxxxooxoxoooxoxoxxxxxxxooooxooooxoooooxxoooox
oxxoxxxoxxoxoooxooxxxoooxooxoxoxoxooxxxxxoooxxooox
ooxxoxoxxxxxxxxoxooxoooooxooxoxxxoxoxooxooxxoooxoo
ooxxxxxxxxoooooooooxxxooxxxxxoxoxooooooooxoooooxxx
oxoxoxooxoooxxxxooooxxxoooxxooxxoooooooxxoxooooxxx
xxooxoxxoxoooooooxoxooooooooxxxoxooooxxooxooxoxxxo
oooooxoxoxxoooxxxxoooxxxxxxoooxooxoxooxxxxooooooxo
oooxxxxoooxooooooooxooooooooxoxxxoxxxxxoxoxxoxoxxo
oxxooxxxxxxxxxxxoxxoooxxooxxoxoxxxxoxxoooxxxxooxox
xooooxxoxxxooooxooxxxoxoxooooxxoxxxxooxooooxxxoooo
oxooooxxoooxxoooxoooxxooxoxxxxxoxooxxooxxxoooxoooo
oxxxxxoxoxxxxoxooxxxxoooxxxooxoooxxooxxooooxxoxxxx
oxoxxoxoxxxxoooxxooxxxxxoxoooxxoooxxxoxxxooxxxooxo
ooxxxooxooxxoooxoxooxoxooooxxoooooxxoxxxxxxxoxooox
xoxoxooxxxxooooxoooxxxxxxxoxoxxoxxxoxoxxooxoxooxxo
xxxxxoxooxxxxxxxooxooxxoxoxxoxxxoooooxxxoxxoxxoooo
oxxxxoooxxooxxooooxxxxoooxooxooxoooxoxxoxxooxxooxo
ooxooooxooxxxxxoxooxoooxxxxxooxxxooxoooxoxxxxooooo
ooooxxxooxxooooxxxoxoooooxxoooxxxxxxoooxoxoxxxxxxx
ooxoxoxxxooooxxoxxoxxxooxxoxoxxxoooxoxooxxxooooxoo
ooxooooxooxoxoooxxxxoooxoxxxxoxooooxxooxooxooxxoox
oxoxoxxxxxoooxoxoxxooooooxooxooxxoooooxxxoxxoooooo
xoxxxxoxxoxxoooooxxooxxoxoxooxooxoxxxxoxoooooxxxxx
oxxxoxoooxoooxxxxoooooxoooooxoxoxooxooooxoxxooxxox
xoxoxxooxoxxxxoxoooooooooxoxoooxoxxoooxoxooooxoxox
xxoooooxooooxxoxooxoxoxoxxxoooooxxxooxxoxxxooxoxox
xooxoooxoxoxoxoxoooooxoooxoxxoooooxoxooxoooxooxoxx
xxoxoxooxoxxoxoooooooooooxoooooxooooooxoxxoxxoooox
oxxoxooxooxxxxxooxxxxxxoxxooxoxoxxxxoxooxoxxxoxoox
oxoxoxxooxooxxoxoooooooxooxoxoxxxxoxxxoxxooooxoxxo
oxxoooxoooxooooxoxxoxoxoxxoxxooxoooxoooxoxxxxxxoxo
xxoooxoxoxooxooooxoooxxxxxxoxxxoooxxooooxxoxoxxoox
xxxoxooxoxxoooxoxoxoxoooxxxoxoxooxxxooxoxoxoxoooxo
xoxxxoooxoooooooxxoxxxooxxxoxxxxooxoooxoooooxxxxox
xooooxoxoxooooooxxxxoxxooxooxxooooxooxxxoxxoooxoxo
oxxooxooooooxxxooxooxxxxxooxxooooxxoxxoxoooxoooxxo
xxxxoxooooxoxooxooxoxoxoxxoxxxxoxoxoxooxxxoxoooxxo
xxxxxoooooxxooxxoooxoxxooxxooooxooooxxxooxoxxxooxx
oooooooxxoxxxooxxxoxoooooooxoxxxxxxooxoooooooxxoxo
ooooooooxxooxxoxxxoxxooooxxooxxoxooxoxxoxooxooxxxx
oxxxxoooxxxxxooxooxxxoxxxxoxxoooxxxxooxxxooxxxxoox
oxoxxoooooxoooxoxoxoxxxoooxxoxoxxxxooooxxoooooooxx
xxoooxoxoxoxoxxxxxxooxxoxoooxxoxxxxxxxxxoooxxoxxxo
oxoooooxoooooxxoooxoxoxoxoooxoxoxxxoxooxxoooxoooox
oxxxxoxooooxooxxxoooxoooooxxooooooxxxoxoxxxoooxxoo
oxooxxoooxoxxxoxxxxxooooxoxxxxxoxoooxoxoxxoxooxooo
xooooooooxxoxxxoxxoxxooxoooooxxxoxooxooxxxoooxooxo
oooooooooxxxoooxxoooxoxooooxoxxoooxoxooxoxooooxooo
oxooxoooxxoooxxxxooxooooooooooxooooxoxoxxxxooxxxxx
xxoxoxxoxxoooooooxxoxxoooxoxxxooooxoooxxxxxxxxooox
ooooxoxoxooooxoxoxoxooxxxoxoxooxxxxoooxoxooxxxoooo
xxxoxxoooxoooooxoxxxooooxooxxxoxoxooxxxxxxoxoxoxoo
oxoxoxooxooxxxxooooxoooxxooooxxoxxxxxooxxxxoxooxxo
oxxoooxxoooooxoooxoooxxooooxxxxoxxxxxoxooxoxooxoxo
oxoxxoxooooxoxxxxoooxxoxoxoxooooxooxooooxoxoxoxxox
xxoooooxxooooooooooxoxxxoxxooxooooxxxooxoxxxxooxoo
xxooxxxxxxxoxxooxoxxxxxxxxoxxoxxooxoxxxoooxoxooxoo
oxxoxoooxoooxoxooooxxxooxooxoooxxoooxxxxxxxoxoxxxo
ooxoxxooxooooxoooooxxoxoxoxoxoxoxooxxoxxooxoooxxox
ooxxxoooxxxxoxxxooxxxooxxxxxoxxxxooxoxooooxxxoxxox
xoxoooxooxooooxxoxoxxxxxxoxxoooxooooxoooxoxoxoxoox
oxooxxoooooxxoxxxxoooxxoxxxooooxxoooxxxxxoooxooooo
xoooooxxooxooxxoooooxoxooxoxxooxooxooxooxxxoooxoxx
ooooxoooooxxoxxooxxooxxooooxxxxoxooooooxoxxxxxxxxo
oxoxoxxoooxooxxooooxoooooxxoxxxoxoooxoxxxxxxoxxoxx
oxooxoxoxooxxoxoooooxooxxxxoooxxoxoxoxooxoxooxxxxo
xooxooxoxoxxoxxxxoxoooxxoxxoooooooooxooooxxxxooxoo
ooxoxxxooxoxxxxoxxoxooooooooooooooxxxoxoxxooxxxoxx
xoooxooxxooxoxooxoxoxxooooooxoooooooooxooxoxoxoxox
oooxxooxoxxxoxxxxxoooxoooooooxoxxxoooxxxxxxxxoooxo
ooxoxoooxxxoooxxxxxxoxxxooxxxxxooxooooxxoxxoooxoxo
xxoooxooxxxooxooooooxooooxoxxxxxxooxoooooxxoxoooxo
xxoxxoxxxxxooxxoooxoxxooxxoxoxooxxooxoxoxoxooxooox
oxxoooooxoxoooooxxxoooooxoooxoxoxxxxxxooxoxoxoxooo
oooxxooxoooxoxxoxoxoxoxxoxxoxooxoxxoxoxxoxoooxxooo
oxoxxxxooxoxoooooxxxxoxooooooxooxxooxooooooxoooooo
oooxxoxoxoxxoxxooxxoxxoxoooxxxooooxooxooxxxoxooooo
xoooooxooxoooxxoooxxxoxoxoxxxoxooxoxxooxooxooxoxoo
ooxoooxxoxoooxoxoooxxooxoooooxoxxxxoxxoxoxoxxoooxx
oooxxooxooooxxoxooxoxoxoooxooxoooooooxoooxxooxooox
oxxoxoxoooooxxxxoxooxoxoxxxoxoxxxoxoxxoxxxoxooxooo
ooooxoooxxxoxooxxooxxxxxoxxxoxxooxoxxoooooxoooxxox
oxoxoxxoxxooooooxoxoooooxxxxxxxxoxooooxoxxoxoooxox
xxxxxxoxoooxxooxooooxxxxooxoxxooxxxxxoxooxxxoooooo
oooooxoooooooooooxooooxxoxooooxxoxxoxxoxooxxoxxooo
xxoooooxooooxxooooxoxoxoxooxxooxxoooxxxoxxoxxoxxxx
xxoooooxooooxoxxoooxooooooooxxoxooxxoxoooxooxoxoxx
oooxoxooxxxxooooxoxooxxooooxoooooxooxxoxxxxxoxxoox
xoxxxxxooooooxxoxxoxoooxxxxoxooxxoooxoooooxxoxoxxo
oxoxoxxoxxoxooooxxxxxooxooooxoxxxoxxooxoxoxoooxxxx
oxxooxoxooooooooxxxoxooooooooxoooxxoooooxxxxoooxox
ooxxoxxooxooooxoxooxoxxooooxxoxoooooooooxoxoooooxo
oxxxxxxoxxxoxoxooxooxoooxoxooooxxoxoxxoxxxoxoxxoxx
oooxxxxxoooooxoooxxoxxoxxxxxxoxooooxxooooxxxoooooo
xooooxxxxooxoxoxxxxoxooooxoxoooxoxoxxxxxooxoxooxoo
xoxoxooxxxxoxxxxooxxoxooxoxooooxoxoxooxxxoxoxxooxo
xoxoooxxxooxooooxooxoooooxxoxoxoxooxoxoxoxoxxxxxox
xxoxxxoxoxooxxxoxxxxoxoxxoxxxoxxoxxxooxxoxoxooxooo
ooooxxoxxoxooxxooxoxooxoooooxooooxxoxooxxoxxxoxoox
oxxoxoxoooxxoooxxxoxxxxooxoooooooooxooxxoxoooxoooo
ooooxoxoxxxoxxxxoxoooxooxoxoooxxxoooooxxxoxoxoxxxo
xxoooxoxoxoxxooxxoxooxooxxoxoxxoxxooxxooxooooooxox
oxoooooxxoxxooxooxxxxooooxoxooxxooxoxoooxxooxoxoox
ooxooxoxooxxxoxooxoxxxxoooxxoxoxooxxoxoooooooxoxxo
oooooxooooxxooxooxooooxoooxxxoooooxoxxxooxxxooxoxx
xxxoooooooxoxxxoxooxxooxxoxoooxooxoxxxxxooooxxxoxx
ooxxoooooxxoxxxxxxxooooxoxxxxxoooooxxooxxxooxxooxo
oxxoxxxxoooxooooooxxoooxoxxoxxoxoooxxoooxooxxooxxx
ooxxooxxxxxxxxxxxxxxoxxxxxxxooooxoxoxxxoxxooxooxox
xoxxoooooooooooxxooooxoooxoxxxoxoxooxoooooooxooooo
xxoxxxxoxxxxxxxooxxoxoxoooxxxxoxooxoxxxoxoooooxoxo
xoxooxooxooooxxxooooxoxooooxxxxxoxxxxoxxxxoxxooxox
xxoxoxoooxxxoxxxooooxxoxoxoooxoxoxoxoxxxoxxxxoxxox
oxoooxooooooxooxoooxooooooxxxxxxoooooxxxxxoxooxooo
xxoxxxooxxxoxoxooooxooooooooxoxxxxoxxoooooxooxoxxo
xoxxxooxoxxoooooxoxoxoxoooxooxoxxxxoxoooxoxoooxoox
ooxxxxoooxoxoxxooxoxoxoooooxoxooxoxxoxooxoxxoxxxxo
oxooxooxooooooooxoooxxxxxxooooxxxxooxxxoooooxoxooo
xoooxooooxxxoxxxooxxxooxooxooxxxxxxooooxxooxxxooox
xoooooxoxxxoxxooxxxxoooxxoooxxoxoooxoxxxxoooooooxo
ooxooooxxxxxooxooxooxxxoooxoxxxooxooxoxxxoxxxxooxo
ooxooooooooxooxxoxoxxoooxxxoxxoxoxxoooxoxxxoooxoxo
xoooooxxxooxoxxoxxooooxoxooooxxxoooxoxxooxoxxoxxxx
xooxxoooxxxoxoxooooxoxoxxxoxooxooxxooxoxxxxxxxxoxx
ooxoxoxooxxoxxoxoxxoxxoxooooxooxoxxoooxoxoxoxxxxxo
xxxxoxoxxoxoooooooxoxxxxooxoooxxoxoxoxxoxoxxxxxoox
oxooxxoxooxxxoooxxoxxoxooxoxoxoxxxxxxxoxooooxooxoo
oxxxoooxooxooxooxxxxooxoooxxoxoooxxoooxooxooxxxoxo
ooxooxxoxxoooooxxxoxxooxxooxooxoxxxooxxxoxooooxoxx
oxooxxooxxxxoxoxxoxxxxoxoooxxoxxxxooxoxxxxxooooxoo
oooxxxooxxxoxxoooooxxooxxxoooxxooxxxoooxoxxooooxoo
oxxoxoxooxoxxooxooxxxxxoooooooooooxoooxxxxoxxxxoox
ooxxoxoxoxxoxxxxxxoooxoooxxooxoxxxoxxoxoooooxooooo
oxooxoooxxooooxooooxoxxxoooxoooxoooooxxxxoxoxxoxxo
ooooooooxxxxoooxooooxooxxxoxooxxxoxxxxooxoxoxooxox
ooxooooxoxxxxxoxxooooooxoxoxooooxxxxxooooxoxooxoox
oxxxoxoxxoooxooooooxoxoooxooxooooooxooooooooooxxxo
xxxoxxxoxoooxxoooooooxooxoooxoxooxooooooxoxxxxxxoo
xoxxxxxooxooooxoxoxooooxoooxoxxoxxxoxxxxxooxoxxoox
ooxxooxoxoxoxxoxooxxoooxoooxxxxxoxoxxxoxoxooxoxoxx
xoxxooxoxoxooxooxooxooxoxoooxoxoooxoooooxoooxxoooo
xooxxoxooxooxxooxxoxoooxooooxxxxoxoooxxoooxxooxoxx
ooooxxxxxxooxoooxoooxoxoxxooxooxxoxoxxxxxxoxxxoxox
xoooxxooooxooxoooxxoxxooooxooxxxxoxxxxxoxxoxooxoox
xxoxxooxooooxxooxoxxooxoooooxoxooxxoooxxxxooxxoxox
ooooxoooxoooooxoxooooxxoxooxoxxooxxoooxxoxoxxxxxoo
ooxoooooxooxxxxooxooooooooxoxxoxxoxxoxxxxxxxxoxxoo
xoxxoxooxxxoxoxxoooxxxxooooxoxooxxooooxxoxxxxxooxo
xxoxooxxoxooxxoxooooxxoxoxoxoxxxoxoxoooxoxooxxxooo
xoooooxxxoxoxoxooxxxxxoxooxoooxoxoxxoxoxooxoxooxox
oxxxxxxxxooxooxooooxxxxoooooxxxxxxxoooxooxoxxoxxxo
oooxooxoxoxooxoxxxxooxooxxoxoxooxoooxoooxxoxoxoooo
oooooxxxxxoooxxooooxxooxoxxxxxoooxxoooxxoxooooooox
ooxoxxoooooxoxoxooxoxoxxoxxoxoxxxoxxxoooxoxoxooxoo
oooxxoxxooooooooxoxoooooxooxxxoxxoxooxxoxxoxooxxoo
xooxoxxxooxoxxxxoxxxooxoooxoxooxxxoxoxooooooooooox
oxooxxoooooxxxoxoxxxooxoooxooxoooxxxoxxxxoxoxxxoox
xoxoxxxoxxoooxxooxoxxooxxxoooooxxoooxxxooxxxoxxxoo
oxxxxoxxoooooooooxxooxoxxoxooxxxoxxxoxxoxxoxxxoxoo
oooxoxoxxxoxooxooooooxxooxoxooxxoxoxoooooxooxxoooo
oxoxxooxoxxxxoxoxxxxxoooxxxxoxoxoooxxoxooxoooxooox
oooxooxooooooooxooxxoxoxoxxooooxxoxooxxxxoxxooxxxo
xooxxoxxoooooxoxxxoxooxooooooxooxxooxoxxooxoxxxoxx
oooooxoxoxxoxooxxooxxxoxooxoxxxoooxxxooooooooxoxox
xxxxoooxoxoxoxxoooxooxooxoxxxooooxxoooooooxxoxxxox
oooxoooooooxoooooxxoooooxooxoxxxxoxooxxxxxooxxoxoo
xxxxoxoxooooxoxooxxoooxooxoxooxoxooooxxoooooxxooxo
xxxooooooooooxxoxxxxoxooxxoxoooooxxxooxxoooxxoxxox
xoooxoxxxoooooxxoxxxoxxxoxoxoxxxxxxooxxoxxoxxooxoo
xoxooxoxooooxxoxoxoooxxoooxxoooxooooooxxxxxxoxxxxo
oxxxxxoxxoxoxoooxooxoxxxxxxooooxoxoxxooxoxxxooxooo
oooxxooooxxxoxxoxooxxxoxooooooxxoxoxxxoxxooooxxoox
ooxxoxxoooxooxxxxoxooooxooooooooxoooxxxoxxxxoxooox
oxoxoooxxoxooxxxoooxoxxxxxooxoxooxxooxxoooxxxoxoxo
xxxxxoooooxoxoxoooooxooxxoxxxoxxoxxxoxxxoooxooxoxo
oxoxxxxoxoxooxxxoooxxoxooooxoxoxxooxxxooxooxxxxxxo
ooxoxxoooxxoxoxoooooooxooooxooooxxxxoxoxxxooxoxxoo
oooooxxxxxxxxxxoxoxoxooooooooooxoxxxoxxooooooxxoxx
xxoxoxoxxoooxoooxxoxooxoxoxoooxooooxoxxxxooooooooo
ooooxxooxooxxxxxoooooooooxoxooxxoxoxxxxooxoxxxoxox
ooooxooxxoooxoooxoxoooxoxooooxoooxoooooxxoxooxooox
oxxoxoxxoxxooxoxoxxoooooooooxxoooxxxxooxxoxxooxxoo
xxxooxxxxxooxxoxooxoooxooooooxxxooooooxxoxoxooooxx
ooxxooooxxoooxooxooxxxoxxxxxxooooooxoxoxoxoxxoxxxo
ooooxooxooxxxooooooooxxoxooooxooxoooooxxxoxooxoooo
oxooxoxoooxxxooxxxoxoxxxxxxxxoooxxoxoxoooooxxoxooo
xoxxxoooxxoooooxxoooooxooxooxxxoxxxooooooooxooxoox
xooxxxooooooooooooxoxxxxooooxooxooxoxxxooooxxxxoxo
xoxxooxoooxoxxooxxxoxxxooxooxooooxxoxxoxxxooooxoox
xxxxoxooxxoxoooooxoooxooxooooxxoxoooxxooooooooxoxo
xxxooxoooooxxoxooxooxxxooooxooooooxoooxxxxxooxxoxx
ooxoooxooxooxoxxoooxxxxxoxxoxooxoxoxxxxxoxooxxoxxo
ooxxoooxxooxxoxxxxooxoxxxxxxooxooxxxoooooooooxxxxx
xxxxoxooooxoxoxoxxxxxoxxoooxooxooooooxxoxxoooxooxx
ooxxxxooxoxoooxxoxxooxxoxoxoooooxxxxoxxoooxooxxxxo
ooxoxooxxoxoxxooxxoxoxoooooooooooooooooooooooooooo
oooooooooooooooooooooooooooooooooooooooooooooooooo
oooooooooooooooooooooooooooooooooooooooooooooooooo
oooooooooooooooooooooooooooooooooooooooooooooooooo
oooooooooooooooooooooooooooooooooooooooooooooooooo
oooooooooooooooooooooooooooooooooooooooooooooooooo
oooooooooooooooooooooooooooooooooooooooooooooooooo
oooooooooooooooooooooooooooooooooooooooooooooooooo
oooooooooooooooooooooooooooooooooooooooooooooooooo
oooooooooooooooooooooooooooooooooooooooooooooooooo
oooooooooooooooooooooooooooooooooooooooooooooooooo
oooooooooooooooooooooooooooooooooooooooooooooooooo
oooooooooooooooooooooooooooooooooooooooooooooooooo
oooooooooooooooooooooooooooooooooooooooooooooooooo
oooooooooooooooooooooooooooooooooooooooooooooooooo
oooooooooooooooooooooooooooooooooooooooooooooooooo
oooooooooooooooooooooooooooooooooooooooooooooooooo
oooooooooooooooooooooooooooooooooooooooooooooooooo
oooooooooooooooooooooooooooooooooooooooooooooooooo
oooooooooooooooooooooooooooooooooooooooooooooooooo
oooooooooooooooooooooooooooooooooooooooooooooooooo
oooooooooooooooooooooooooooooooooooooooooooooooooo
oooooooooooooooooooooooooooooooooooooooooooooooooo
oooooooooooooooooooooooooooooooooooooooooooooooooo
oooooooooooooooooooooooooooooooooooooooooooooooooo
ooooooo
Array list ---
xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
xxxxxxxxxxxxxoxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
xxxxxxxxxxxxxxxxxxxxxoxxxxxxxxxxxxxxxxxxxxxxxxxxxx
xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
xxxxxoxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx
xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxooooxxx
oooxxxooxxooxxooxxoxxoooxxoooxxoooxooxoxxooooxoooo
ooxooxxxxxxxooxoooooxoxxoxooxooooxxxxxooxxooooxxoo
oxooxxxxoxoxxxooooooxooooxoxoooxoxoxxoxooooxoxxoox
oooooxooxxoooooooooxoxxxxoxoooooxxooxxoxxoxooxoxoo
oxoooooooooooooxxxxxxxoooooooxooxooxxxoxooxxoxooox
ooooxooxxoooxoxxooooxooxxoxxxxoxxxoooooxxoxooxxooo
xxoooxoxoxxooxxxxxxxxooxoxxoxxxxoxxxoxoooxxoxooxxo
xoxoooxoxoxoxooooooxoxxoooxxxoxoxooooooooooxxxooxx
oxxxxooxxoxxxxoxoxxoooooooooxooxxxoooooxoooooxoxxo
oooooxxoxxoxooxoxxooxxxooxxxxxoooooooxxoxoxxoxoxxx
xoxoxxxxoxxoxxxxooxoooxxoxxxooxoxxxxoxxooxxoxxooxo
xxooxoooxxxoxooooooxooxxxoxoooxoxoxoxxxxooooxoxxox
xoxoxoooooxoxoxooxoxxooxooooxooxoooxoxxoooxxoooooo
oxoxxxooooxoooooxoxoooxoxoooooxxxoxxoxxoooxxxooxox
xxoooxoxoxxoooxooxoxxxoxooxxxooooxxooxooxoooxxoxxx
ooxxxooxooooxxxxooxooooooxxooooooxxxxxxxooxxxxoxxo
oooxoooxoooxxxooooooxxoxoooxxooxoooxoooooooxooooox
oooooxoxxxxxooxxooxoooooxooxoxoooooxooxooxoooxxxoo
ooooxoooxoxooooooooxoxooooxoxoxooxooxoxooooooxxooo
oxoooxxxxooxooooooooooxooooxoooooxoxxxoxooooooxxoo
xoxoooxoooxxooxxoxxooxooooooxoooooxoooooxooxooxoxo
oxxoooooxooxoooxooxooooooxoooxoxxoxxooxxoxooooxoxo
xoooooxoooxoxxxxooooxooxxoooxxxoxoooxxoxxxooooxoxx
ooooxoooxxooxxooooooxooooooxoxoxxooooooooooxoooxox
oxxxxxooxoxooooooooxooooooxoxooxoooxoooxxoxoooooxx
xooxoooooooxooxxoooxoooxxooxoooooxxxoooxoxxooxxoox
xxoooooooooooooooxooxoooxooxoooxooxoooooooooxoooxo
oxoxooxoooxoooxoooooooxooxxxxxooooxxxooooxooooooxo
ooxxooxoxoooooooooxxxoxoxoooooxoxooooxxxoxooxxoxoo
oxxoxxxxoooooxoxoxxoooxoxooooxxoxooxooooooxooooxoo
xoxxooooxoxxxxooooooooooooxoooooxoooxoooooxxoooooo
oxooooooxooooxxoooooooxooooxxooooxooxxooooooooxooo
ooxooooooxoxoooooxoxxooxxxxooooxxoooxoxxxxxxoxoxxx
oxoooxoooooooxxxxxooxooxxoxxxooxxooooxooxxooxoxooo
oxxoooxooxoxooooooxxxooooooxooxoxxoooooxoooooxoooo
xoooooxoooxxxooxxooxoxxoooxoxxoooxooooxooxooooooox
xoooxooooooxoxoooxoxoxxooooxxoooooxoooooxxooooxxxo
oxooxoxooooxxoooooooxoooooooooooxoooxxoooxooooooxx
xoooxoxoooooooxxooooxooooxoooxoxoooooooxxxoxoooxxo
oooooooooooxooxooxoooxoxoooxxxoxoooooxoxoxxxooooox
oxxooxoooooxoooxxooooxoxoooooxooxoooxxoooooxoooooo
oooooxxxoxoxoxxooxoxxxxoxxoooxooxoxoxoooxoxooxoooo
xxxoooooooxooxxoxxooxooooooooooxooxxooooxxooxooooo
oooxoooxoxxxxxooooxxooxxoxxxooxooxoxoxoooxoxoxxxxo
ooooooooooxooxxxxxooxooxxooxoxooooooxxxxoooooxxooo
ooooxoooooxoooxxxoxxxooooooooooxxooooxxoxooxxoxoxx
oooooooxxooooxxoooooooxooooooooxoxooxooooooooxooox
oooxoxxooooxooxoxxxoooxoxoooxoxoxxxxooxoxxoooooooo
oooxooxoooxoooooxoooooxxxooxxooxoooxooxooooooooxxx
ooooxxoooooxoxoooxooxoxxooooxxoooxooxxoxooxoxxooxo
ooooxooxoxxooooooxoooooxooxoo

mtest> q -f



###########
#   do5   #
###########
mtest> mtnew 10

mtest> mtnew 5 -a 512

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 65536 Bytes
* Number of blocks      : 2
* Free mem in last block: 28656
* Recycle list          : 
[272] = 1         
=========================================
=             class MemTest             =
=========================================
Object list ---
oooooooooo
Array list ---
ooooo

mtest> mtnew 5 -a 1024

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 65536 Bytes
* Number of blocks      : 7
* Free mem in last block: 28664
* Recycle list          : 
[272] = 1         [795] = 1         [796] = 4         
=========================================
=             class MemTest             =
=========================================
Object list ---
oooooooooo
Array list ---
oooooooooo

mtest> mtnew 5 -a 256

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 65536 Bytes
* Number of blocks      : 8
* Free mem in last block: 47088
* Recycle list          : 
[272] = 1         [ 27] = 1         [795] = 1         [796] = 4         

=========================================
=             class MemTest             =
=========================================
Object list ---
oooooooooo
Array list ---
ooooooooooooooo

mtest> mtdel -i 3

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 65536 Bytes
* Number of blocks      : 8
* Free mem in last block: 47088
* Recycle list          : 
[  0] = 1         [272] = 1         [ 27] = 1         [795] = 1         
[796] = 4         
=========================================
=             class MemTest             =
=========================================
Object list ---
oooxoooooo
Array list ---
ooooooooooooooo

mtest> mtdel -i 4 -a

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 65536 Bytes
* Number of blocks      : 8
* Free mem in last block: 47088
* Recycle list          : 
[  0] = 1         [512] = 1         [272] = 1         [ 27] = 1         
[795] = 1         [796] = 4         
=========================================
=             class MemTest             =
=========================================
Object list ---
oooxoooooo
Array list ---
ooooxoooooooooo

mtest> mtdel -i 8 -a

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 65536 Bytes
* Number of blocks      : 8
* Free mem in last block: 47088
* Recycle list          : 
[  0] = 1         [512] = 1         [1024] = 1         [272] = 1         
[ 27] = 1         [795] = 1         [796] = 4         
=========================================
=             class MemTest             =
=========================================
Object list ---
oooxoooooo
Array list ---
ooooxoooxoooooo

mtest> mtdel -i 13 -a

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 65536 Bytes
* Number of blocks      : 8
* Free mem in last block: 47088
* Recycle list          : 
[  0] = 1         [512] = 1         [1024] = 1         [256] = 1         
[272] = 1         [ 27] = 1         [795] = 1         [796] = 4         

=========================================
=             class MemTest             =
=========================================
Object list ---
oooxoooooo
Array list ---
ooooxoooxooooxo

mtest> mtr 120

mtest> mtp
=========================================
=              Memory Manager           =
=========================================
* Block size            : 120 Bytes
* Number of blocks      : 1
* Free mem in last block: 120
* Recycle list          : 

=========================================
=             class MemTest             =
=========================================
Object list ---

Array list ---


mtest> q -f

